<?php

use Major\Fluent\Formatters\Number\Locale\Unit as U;

return [
    'acre' => new U(['one' => 'فدان', 'few' => '{0} أفدنة', 'many' => '{0} فدانًا', 'other' => '{0} فدان'], ['one' => 'فدان', 'two' => 'فدانان', 'few' => '{0} أفدنة', 'many' => '{0} فدانًا', 'other' => '{0} فدان'], ['one' => 'فدان', 'two' => 'فدانان', 'few' => '{0} أفدنة', 'many' => '{0} فدانًا', 'other' => '{0} فدان']),
    'centimeter' => new U(['two' => 'سنتيمتران', 'few' => '{0} سنتيمترات', 'many' => '{0} سنتيمترًا', 'other' => '{0} سنتيمتر'], '{0} سم', '{0} سم'),
    'fluid-ounce' => new U(['one' => 'أونصة سائلة', 'two' => 'أونصتان سائلتان', 'other' => '{0} أونصة سائلة'], ['one' => 'أونصة س', 'two' => 'أونصتان سائلتان', 'few' => '{0} أونصات سائلة', 'many' => '{0} أونصة س', 'other' => '{0} أونصة سائلة'], ['one' => 'أونصة س', 'two' => 'أونصتان سائلتان', 'other' => '{0} أونصة س']),
    'foot' => new U(['one' => 'قدم', 'two' => 'قدمان', 'few' => '{0} أقدام', 'many' => '{0} قدمًا', 'other' => '{0} قدم'], ['one' => 'قدم', 'two' => 'قدمان', 'few' => '{0} أقدام', 'many' => '{0} قدمًا', 'other' => '{0} قدم'], ['one' => 'قدم', 'two' => 'قدمان', 'few' => '{0} أقدام', 'many' => '{0} قدمًا', 'other' => '{0} قدم']),
    'gram' => new U(['one' => 'غرام', 'two' => 'غرامان', 'few' => '{0} غرامات', 'many' => '{0} غرامًا', 'other' => '{0} غرام'], ['one' => 'غرام', 'two' => 'غرامان', 'few' => '{0} غرامات', 'many' => '{0} غرامًا', 'other' => '{0} غرام'], '{0} غم'),
    'hectare' => new U(['two' => 'هكتاران', 'few' => '{0} هكتارات', 'many' => '{0} هكتارًا', 'other' => '{0} هكتار'], ['two' => 'هكتاران', 'few' => '{0} هكتارات', 'many' => '{0} هكتارًا', 'other' => '{0} هكتار'], ['two' => 'هكتاران', 'few' => '{0} هكتارات', 'many' => '{0} هكتارًا', 'other' => '{0} هكتار']),
    'inch' => new U(['two' => 'بوصتان', 'few' => '{0} بوصات', 'other' => '{0} بوصة'], ['two' => 'بوصتان', 'few' => '{0} بوصات', 'other' => '{0} بوصة'], '{0} بوصة'),
    'kilogram' => new U(['two' => 'كيلوغرامان', 'few' => '{0} كيلوغرامات', 'many' => '{0} كيلوغرامًا', 'other' => '{0} كيلوغرام'], '{0} كغم', '{0} كغم'),
    'kilometer' => new U(['two' => 'كيلومتران', 'few' => '{0} كيلومترات', 'many' => '{0} كيلومترًا', 'other' => '{0} كيلومتر'], '{0} كم', '{0} كم'),
    'liter' => new U(['one' => 'لتر', 'two' => 'لتران', 'few' => '{0} لترات', 'many' => '{0} لترًا', 'other' => '{0} لتر'], ['one' => 'لتر', 'two' => 'لتران', 'few' => '{0} لترات', 'many' => '{0} لترًا', 'other' => '{0} لتر'], '{0} ل'),
    'mile' => new U(['one' => 'ميل', 'two' => 'ميلان', 'few' => '{0} أميال', 'many' => '{0} ميلاً', 'other' => '{0} ميل'], ['one' => 'ميل', 'two' => 'ميلان', 'few' => '{0} أميال', 'other' => '{0} ميل'], ['few' => '{0} أميال', 'many' => '{0} ميلاً', 'other' => '{0} ميل']),
    'mile-scandinavian' => new U(['two' => 'ميلان اسكندنافيان', 'few' => '{0} أميال اسكندنافية', 'many' => '{0} ميلًا اسكندنافيًا', 'other' => '{0} ميل اسكندنافي'], ['two' => 'ميلان اسكندنافيان', 'few' => '{0} أميال اسكندنافية', 'many' => '{0} ميلًا اسكندنافيًا', 'other' => '{0} ميل اسكندنافي'], ['two' => 'ميلان اسكندنافيان', 'few' => '{0} أميال اسكندنافية', 'many' => '{0} ميلًا اسكندنافيًا', 'other' => '{0} ميل اسكندنافي']),
    'millimeter' => new U(['two' => 'مليمتران', 'many' => '{0} مليمترًا', 'other' => '{0} مليمتر'], '{0} مم', '{0} مم'),
    'pound' => new U(['two' => 'رطلان', 'few' => '{0} أرطال', 'many' => '{0} رطلًا', 'other' => '{0} رطل'], ['two' => 'رطلان', 'few' => '{0} أرطال', 'many' => '{0} رطلُا', 'other' => '{0} رطل'], ['two' => 'رطلان', 'few' => '{0} أرطال', 'many' => '{0} رطلُا', 'other' => '{0} رطل']),
    'second' => new U(['one' => 'ثانية', 'two' => 'ثانيتان', 'few' => '{0} ثوانٍ', 'other' => '{0} ثانية'], '{0} ث', '{0} ث'),
    'yard' => new U(['one' => 'ياردة', 'two' => 'ياردتان', 'few' => '{0} ياردات', 'other' => '{0} ياردة'], ['one' => 'ياردة', 'two' => 'ياردتان', 'few' => '{0} ياردات', 'other' => '{0} ياردة'], ['two' => 'ياردتان', 'other' => '{0} ياردة']),
    'year' => new U(['one' => 'سنة', 'two' => 'سنتان', 'few' => '{0} سنوات', 'other' => '{0} سنة'], ['one' => 'سنة', 'two' => 'سنتان', 'few' => '{0} سنوات', 'other' => '{0} سنة'], ['one' => 'سنة', 'two' => 'سنتان', 'few' => '{0} سنوات', 'other' => '{0} سنة']),
];
