<?php

use Major\Fluent\Formatters\Number\Locale\Unit as U;

return [
    'microsecond' => new U(['one' => '{0} мікрасекунда', 'few' => '{0} мікрасекунды', 'many' => '{0} мікрасекунд', 'other' => '{0} мікрасекунды'], ['one' => '{0} мкс', 'few' => '{0} мкс', 'many' => '{0} мкс', 'other' => '{0} мкс'], ['one' => '{0} мкс.', 'few' => '{0} мкс.', 'many' => '{0} мкс.', 'other' => '{0} мкс.']),
    'nanosecond' => new U(['one' => '{0} нанасекунда', 'few' => '{0} нанасекунды', 'many' => '{0} нанасекунд', 'other' => '{0} нанасекунды'], ['one' => '{0} нс', 'few' => '{0} нс', 'many' => '{0} нс', 'other' => '{0} нс'], ['one' => '{0} нсэк.', 'few' => '{0} нсэк.', 'many' => '{0} нсэк.', 'other' => '{0} нсэк.']),
];
