<?php

use Major\Fluent\Formatters\Number\Locale\Currency as C;

return [
    'BAM' => new C('BAM', 'Босанскохерцеговачка конвертибилна марка', 'КМ', plurals: ['one' => 'босанскохерцеговачка конвертибилна марка', 'few' => 'босанскохерцеговачке конвертибилне маркe', 'other' => 'босанскохерцеговачких конвертибилних марака']),
    'BYN' => new C('BYN', 'Бјелоруска рубља', plurals: ['one' => 'бјелоруска рубља', 'few' => 'бјелоруске рубље', 'other' => 'бјелоруских рубљи']),
    'KPW' => new C('KPW', 'Сјевернокорејски вон', plurals: ['one' => 'сјевернокорејски вон', 'few' => 'сјевернокорејска вона', 'other' => 'сјевернокорејских вона']),
];
